class AppConstant {
  static final String baseUrl = 'https://back.kazakhiauto.kz/';
  // static final String baseUrl = 'http://localhost:3000/';

  static const List<String> emojis = ['🤩', '😌', '😶', '🙁'];
  static const countriesCode = {
    "it": {"kk": "Италия", "ru": "Италия", "en": "Italy"},
    "es": {"kk": "Испания", "ru": "Испания", "en": "Spain"},
    "fr": {"kk": "Франция", "ru": "Франция", "en": "France"},
    "de": {"kk": "Германия", "ru": "Германия", "en": "Germany"},
    "hu": {"kk": "Венгрия", "ru": "Венгрия", "en": "Hungary"},
    "kr": {"kk": "Оңтүстік Корея", "ru": "Южная Корея", "en": "South Korea"},
    "tr": {"kk": "Түркия", "ru": "Турция", "en": "Turkey"},
    "au": {"kk": "Аустралия", "ru": "Австралия", "en": "Australia"},
    "ca": {"kk": "Канада", "ru": "Канада", "en": "Canada"},
    "us": {"kk": "АҚШ", "ru": "США", "en": "USA"},
    "jp": {"kk": "Жапония", "ru": "Япония", "en": "Japan"},
    "cn": {"kk": "Қытай", "ru": "Китай", "en": "China"},
    "sg": {"kk": "Сингапур", "ru": "Сингапур", "en": "Singapore"},
    "my": {"kk": "Малайзия", "ru": "Малайзия", "en": "Malaysia"},
    "uk": {"kk": "Ұлыбритания", "ru": "Великобритания", "en": "United Kingdom"},
    "at": {"kk": "Аустрия", "ru": "Австрия", "en": "Austria"},
    "pl": {"kk": "Польша", "ru": "Польша", "en": "Poland"},
    "cz": {"kk": "Чехия", "ru": "Чехия", "en": "Czech Republic"},
    "hk": {"kk": "Гонконг", "ru": "Гонконг", "en": "Hong Kong"},
    "cy": {"kk": "Кипр", "ru": "Кипр", "en": "Cyprus"},
    "nl": {"kk": "Нидерланд", "ru": "Нидерланды", "en": "Netherlands"},
    "ae": {
      "kk": "Біріккен Араб Әмірліктері",
      "ru": "Объединенные Арабские Эмираты",
      "en": "United Arab Emirates",
    },
    "ie": {"kk": "Ирландия", "ru": "Ирландия", "en": "Ireland"},
  };
}
